Тестдоработка/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиента</name>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестдоработка/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>РезервированиеТоваровЗаказКлиента</name>
  </enumValues>
</mdclass:Enum>

Тестдоработка/src/Documents/ЗаказКлиента/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
	
	// 1. Создаем объект запрос
	Запрос = Новый Запрос;
	// 2. Для ВТ подключаем менеджера
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	// 3. Заполняем данные
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	

КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)

	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказКлиента.Номер 				  КАК Номер,
		|	ЗаказКлиента.Дата 				  КАК Дата,
		|	ЗаказКлиента.Проведен 			  КАК Проведен,
		|	ЗаказКлиента.ПометкаУдаления 	  КАК ПометкаУдаления,
		|	ЗаказКлиента.Клиент 			  КАК Клиент,
		|	ЗаказКлиента.Склад 				  КАК Склад,
		|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиента.Склад) КАК СкладПредставление
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Ссылка = &ДокументСсылка";
	
	Результат = Запрос.Выполнить();
	Реквизиты = Результат.Выбрать();
	Реквизиты.Следующий();
	
	// Данные реквизита документа, потом будут нужны для формрования движений
	Для каждого Колонка Из Результат.Колонки Цикл
		Запрос.УстановитьПараметр(Колонка.Имя, Реквизиты[Колонка.Имя]);
	КонецЦикла;
	
	// Данные служебные, настройки и т.д.
	ЗначенияПараметровПроведения = ЗначенияПараметровПроведения(Реквизиты);
	Для каждого Элемент Из ЗначенияПараметровПроведения Цикл
		Запрос.УстановитьПараметр(Элемент.Имя, Элемент.Значение);
	КонецЦикла;
		
КонецПроцедуры

Функция ЗначенияПараметровПроведения(Реквизиты = Неопределено)

	ЗначенияПараметровПроведения = Новый Структура;
	ЗначенияПараметровПроведения.Вставить("ИдентификаторМетаданных", ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.ЗаказКлиента"));
	ЗначенияПараметровПроведения.Вставить("ХозяйственнаяОперация",   Перечисления.ХозяйственныеОперации.РезервированиеТоваровЗаказКлиента);
	
	Если Реквизиты <> Неопределено Тогда
		ЗначенияПараметровПроведения.Вставить("НомерНаПечать", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер));
	КонецЕсли;
	
	Возврат ЗначенияПараметровПроведения;

КонецФункции
